pragma solidity ^0.5.16; //เราจะใช้ เวอร์ชั้น^0.5.16 ขึนไป 

contract MyData { //  สีน้ำเงิน การใช้ฟังก์ชั่น  สีเขียว การตั้งชื่อ ตัวพิมพ์เล็กตัวพิมพืใหญ่แตกต่างกันจะตองขึ้นต้นด้วยตัวอักษร {} ใช้เป็นตัวบอขอบเขต
  uint myVariable; // uint  เป็นเลขจำนวนเต็ม ตัวแปรตัวแรกมักจะเป้นตัวพิมพ์เล็ก ;จบคำสั่ง

  function set(uint x) public { // ชื่อฟังก์ชั่นมักจะเป็นตัวพิมพืเล็ก ()ตัวแปร {}ใช้ในการเริ่มต้นฟังก์ชั่น setเสียตัง  set() myVariable
    myVariable = x;
  }

  function get() view public returns (uint) { // get()  ไม่มีพารามิตเตอร์อะไรท่ส่งในฟังก์ชั่น view อ่านฟรีไม่เสียตังแสดงผลข้อมูลม
    return myVariable; // get() อ่านค่า myVariable
  } 
}
